Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 120, 160, 3)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 60, 80, 16)        1216      
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 30, 40, 8)         3208      
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 15, 20, 4)         804       
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 8, 10, 4)          404       
_________________________________________________________________
flatten_3 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 32)                10272     
_________________________________________________________________
dense_8 (Dense)              (None, 16)                528       
_________________________________________________________________
dense_9 (Dense)              (None, 8)                 136       
_________________________________________________________________
dense_10 (Dense)             (None, 4)                 36        
=================================================================
Total params: 16,604
Trainable params: 16,604
Non-trainable params: 0
_________________________________________________________________
