Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 60, 80, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 30, 40, 16)        1216      
_________________________________________________________________
batch_normalization_1 (Batch (None, 30, 40, 16)        64        
_________________________________________________________________
dropout_1 (Dropout)          (None, 30, 40, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 15, 20, 8)         3208      
_________________________________________________________________
batch_normalization_2 (Batch (None, 15, 20, 8)         32        
_________________________________________________________________
dropout_2 (Dropout)          (None, 15, 20, 8)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 8, 10, 4)          804       
_________________________________________________________________
batch_normalization_3 (Batch (None, 8, 10, 4)          16        
_________________________________________________________________
dropout_3 (Dropout)          (None, 8, 10, 4)          0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 5, 4)           404       
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 5, 4)           16        
_________________________________________________________________
dropout_4 (Dropout)          (None, 4, 5, 4)           0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 80)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2592      
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_6 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 136       
_________________________________________________________________
dropout_7 (Dropout)          (None, 8)                 0         
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 36        
=================================================================
Total params: 9,052
Trainable params: 8,988
Non-trainable params: 64
_________________________________________________________________
