Model: "model_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         (None, 120, 160, 3)       0         
_________________________________________________________________
conv1_pad (ZeroPadding2D)    (None, 121, 161, 3)       0         
_________________________________________________________________
conv1 (Conv2D)               (None, 60, 80, 32)        864       
_________________________________________________________________
conv1_bn (BatchNormalization (None, 60, 80, 32)        128       
_________________________________________________________________
conv1_relu (ReLU)            (None, 60, 80, 32)        0         
_________________________________________________________________
conv_dw_1 (DepthwiseConv2D)  (None, 60, 80, 32)        288       
_________________________________________________________________
conv_dw_1_bn (BatchNormaliza (None, 60, 80, 32)        128       
_________________________________________________________________
conv_dw_1_relu (ReLU)        (None, 60, 80, 32)        0         
_________________________________________________________________
conv_pw_1 (Conv2D)           (None, 60, 80, 64)        2048      
_________________________________________________________________
conv_pw_1_bn (BatchNormaliza (None, 60, 80, 64)        256       
_________________________________________________________________
conv_pw_1_relu (ReLU)        (None, 60, 80, 64)        0         
_________________________________________________________________
conv_pad_2 (ZeroPadding2D)   (None, 61, 81, 64)        0         
_________________________________________________________________
conv_dw_2 (DepthwiseConv2D)  (None, 30, 40, 64)        576       
_________________________________________________________________
conv_dw_2_bn (BatchNormaliza (None, 30, 40, 64)        256       
_________________________________________________________________
conv_dw_2_relu (ReLU)        (None, 30, 40, 64)        0         
_________________________________________________________________
conv_pw_2 (Conv2D)           (None, 30, 40, 128)       8192      
_________________________________________________________________
conv_pw_2_bn (BatchNormaliza (None, 30, 40, 128)       512       
_________________________________________________________________
conv_pw_2_relu (ReLU)        (None, 30, 40, 128)       0         
_________________________________________________________________
conv_dw_3 (DepthwiseConv2D)  (None, 30, 40, 128)       1152      
_________________________________________________________________
conv_dw_3_bn (BatchNormaliza (None, 30, 40, 128)       512       
_________________________________________________________________
conv_dw_3_relu (ReLU)        (None, 30, 40, 128)       0         
_________________________________________________________________
conv_pw_3 (Conv2D)           (None, 30, 40, 128)       16384     
_________________________________________________________________
conv_pw_3_bn (BatchNormaliza (None, 30, 40, 128)       512       
_________________________________________________________________
conv_pw_3_relu (ReLU)        (None, 30, 40, 128)       0         
_________________________________________________________________
conv_pad_4 (ZeroPadding2D)   (None, 31, 41, 128)       0         
_________________________________________________________________
conv_dw_4 (DepthwiseConv2D)  (None, 15, 20, 128)       1152      
_________________________________________________________________
conv_dw_4_bn (BatchNormaliza (None, 15, 20, 128)       512       
_________________________________________________________________
conv_dw_4_relu (ReLU)        (None, 15, 20, 128)       0         
_________________________________________________________________
conv_pw_4 (Conv2D)           (None, 15, 20, 256)       32768     
_________________________________________________________________
conv_pw_4_bn (BatchNormaliza (None, 15, 20, 256)       1024      
_________________________________________________________________
conv_pw_4_relu (ReLU)        (None, 15, 20, 256)       0         
_________________________________________________________________
conv_dw_5 (DepthwiseConv2D)  (None, 15, 20, 256)       2304      
_________________________________________________________________
conv_dw_5_bn (BatchNormaliza (None, 15, 20, 256)       1024      
_________________________________________________________________
conv_dw_5_relu (ReLU)        (None, 15, 20, 256)       0         
_________________________________________________________________
conv_pw_5 (Conv2D)           (None, 15, 20, 256)       65536     
_________________________________________________________________
conv_pw_5_bn (BatchNormaliza (None, 15, 20, 256)       1024      
_________________________________________________________________
conv_pw_5_relu (ReLU)        (None, 15, 20, 256)       0         
_________________________________________________________________
conv_pad_6 (ZeroPadding2D)   (None, 16, 21, 256)       0         
_________________________________________________________________
conv_dw_6 (DepthwiseConv2D)  (None, 7, 10, 256)        2304      
_________________________________________________________________
conv_dw_6_bn (BatchNormaliza (None, 7, 10, 256)        1024      
_________________________________________________________________
conv_dw_6_relu (ReLU)        (None, 7, 10, 256)        0         
_________________________________________________________________
conv_pw_6 (Conv2D)           (None, 7, 10, 512)        131072    
_________________________________________________________________
conv_pw_6_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_pw_6_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_dw_7 (DepthwiseConv2D)  (None, 7, 10, 512)        4608      
_________________________________________________________________
conv_dw_7_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_dw_7_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_pw_7 (Conv2D)           (None, 7, 10, 512)        262144    
_________________________________________________________________
conv_pw_7_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_pw_7_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_dw_8 (DepthwiseConv2D)  (None, 7, 10, 512)        4608      
_________________________________________________________________
conv_dw_8_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_dw_8_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_pw_8 (Conv2D)           (None, 7, 10, 512)        262144    
_________________________________________________________________
conv_pw_8_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_pw_8_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_dw_9 (DepthwiseConv2D)  (None, 7, 10, 512)        4608      
_________________________________________________________________
conv_dw_9_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_dw_9_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_pw_9 (Conv2D)           (None, 7, 10, 512)        262144    
_________________________________________________________________
conv_pw_9_bn (BatchNormaliza (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_pw_9_relu (ReLU)        (None, 7, 10, 512)        0         
_________________________________________________________________
conv_dw_10 (DepthwiseConv2D) (None, 7, 10, 512)        4608      
_________________________________________________________________
conv_dw_10_bn (BatchNormaliz (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_dw_10_relu (ReLU)       (None, 7, 10, 512)        0         
_________________________________________________________________
conv_pw_10 (Conv2D)          (None, 7, 10, 512)        262144    
_________________________________________________________________
conv_pw_10_bn (BatchNormaliz (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_pw_10_relu (ReLU)       (None, 7, 10, 512)        0         
_________________________________________________________________
conv_dw_11 (DepthwiseConv2D) (None, 7, 10, 512)        4608      
_________________________________________________________________
conv_dw_11_bn (BatchNormaliz (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_dw_11_relu (ReLU)       (None, 7, 10, 512)        0         
_________________________________________________________________
conv_pw_11 (Conv2D)          (None, 7, 10, 512)        262144    
_________________________________________________________________
conv_pw_11_bn (BatchNormaliz (None, 7, 10, 512)        2048      
_________________________________________________________________
conv_pw_11_relu (ReLU)       (None, 7, 10, 512)        0         
_________________________________________________________________
conv_pad_12 (ZeroPadding2D)  (None, 8, 11, 512)        0         
_________________________________________________________________
conv_dw_12 (DepthwiseConv2D) (None, 3, 5, 512)         4608      
_________________________________________________________________
conv_dw_12_bn (BatchNormaliz (None, 3, 5, 512)         2048      
_________________________________________________________________
conv_dw_12_relu (ReLU)       (None, 3, 5, 512)         0         
_________________________________________________________________
conv_pw_12 (Conv2D)          (None, 3, 5, 1024)        524288    
_________________________________________________________________
conv_pw_12_bn (BatchNormaliz (None, 3, 5, 1024)        4096      
_________________________________________________________________
conv_pw_12_relu (ReLU)       (None, 3, 5, 1024)        0         
_________________________________________________________________
conv_dw_13 (DepthwiseConv2D) (None, 3, 5, 1024)        9216      
_________________________________________________________________
conv_dw_13_bn (BatchNormaliz (None, 3, 5, 1024)        4096      
_________________________________________________________________
conv_dw_13_relu (ReLU)       (None, 3, 5, 1024)        0         
_________________________________________________________________
conv_pw_13 (Conv2D)          (None, 3, 5, 1024)        1048576   
_________________________________________________________________
conv_pw_13_bn (BatchNormaliz (None, 3, 5, 1024)        4096      
_________________________________________________________________
conv_pw_13_relu (ReLU)       (None, 3, 5, 1024)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 15360)             0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 15360)             0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               3932416   
_________________________________________________________________
batch_normalization_3 (Batch (None, 256)               1024      
_________________________________________________________________
dense_6 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 7,163,332
Trainable params: 7,140,068
Non-trainable params: 23,264
_________________________________________________________________
