Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 120, 160, 3)       0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 60, 80, 16)        1216      
_________________________________________________________________
batch_normalization_1 (Batch (None, 60, 80, 16)        64        
_________________________________________________________________
dropout_1 (Dropout)          (None, 60, 80, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 30, 40, 8)         3208      
_________________________________________________________________
batch_normalization_2 (Batch (None, 30, 40, 8)         32        
_________________________________________________________________
dropout_2 (Dropout)          (None, 30, 40, 8)         0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 15, 20, 4)         804       
_________________________________________________________________
batch_normalization_3 (Batch (None, 15, 20, 4)         16        
_________________________________________________________________
dropout_3 (Dropout)          (None, 15, 20, 4)         0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 8, 10, 4)          404       
_________________________________________________________________
batch_normalization_4 (Batch (None, 8, 10, 4)          16        
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 10, 4)          0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 320)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                10272     
_________________________________________________________________
dropout_5 (Dropout)          (None, 32)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 16)                528       
_________________________________________________________________
dropout_6 (Dropout)          (None, 16)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 8)                 136       
_________________________________________________________________
dropout_7 (Dropout)          (None, 8)                 0         
_________________________________________________________________
dense_4 (Dense)              (None, 4)                 36        
=================================================================
Total params: 16,732
Trainable params: 16,668
Non-trainable params: 64
_________________________________________________________________
