Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 64, 64, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 62, 62, 64)        1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 62, 62, 64)        256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 62, 62, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 60, 60, 64)        36928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 60, 60, 64)        256       
_________________________________________________________________
dropout_2 (Dropout)          (None, 60, 60, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 30, 30, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 128)       73856     
_________________________________________________________________
batch_normalization_3 (Batch (None, 28, 28, 128)       512       
_________________________________________________________________
dropout_3 (Dropout)          (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 26, 26, 128)       147584    
_________________________________________________________________
batch_normalization_4 (Batch (None, 26, 26, 128)       512       
_________________________________________________________________
dropout_4 (Dropout)          (None, 26, 26, 128)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 13, 13, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 11, 11, 256)       295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 11, 11, 256)       1024      
_________________________________________________________________
dropout_5 (Dropout)          (None, 11, 11, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 9, 9, 256)         590080    
_________________________________________________________________
batch_normalization_6 (Batch (None, 9, 9, 256)         1024      
_________________________________________________________________
dropout_6 (Dropout)          (None, 9, 9, 256)         0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 7, 7, 256)         590080    
_________________________________________________________________
batch_normalization_7 (Batch (None, 7, 7, 256)         1024      
_________________________________________________________________
dropout_7 (Dropout)          (None, 7, 7, 256)         0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 4, 4, 256)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 2, 2, 512)         1180160   
_________________________________________________________________
batch_normalization_8 (Batch (None, 2, 2, 512)         2048      
_________________________________________________________________
dropout_8 (Dropout)          (None, 2, 2, 512)         0         
_________________________________________________________________
dense_1 (Dense)              (None, 2, 2, 512)         262656    
_________________________________________________________________
dense_2 (Dense)              (None, 2, 2, 4)           2052      
=================================================================
Total params: 3,187,012
Trainable params: 3,183,684
Non-trainable params: 3,328
_________________________________________________________________
