Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 118, 158, 32)      896       
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 59, 79, 32)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 59, 79, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 57, 77, 64)        18496     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 38, 64)        0         
_________________________________________________________________
dropout_2 (Dropout)          (None, 28, 38, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 26, 36, 128)       73856     
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 13, 18, 128)       0         
_________________________________________________________________
dropout_3 (Dropout)          (None, 13, 18, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 11, 16, 128)       147584    
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, 5, 8, 128)         0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 5, 8, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 5120)              0         
_________________________________________________________________
dropout_5 (Dropout)          (None, 5120)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               2621952   
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 2052      
=================================================================
Total params: 2,864,836
Trainable params: 2,864,836
Non-trainable params: 0
_________________________________________________________________
