Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 128, 128, 3)  0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 128, 128, 12) 912         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 128, 128, 12) 48          conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 128, 128, 12) 156         batch_normalization_2[0][0]      
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 128, 128, 12) 48          conv2d_2[0][0]                   
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 128, 128, 12) 156         batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 128, 128, 12) 1308        batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 128, 128, 12) 48          conv2d_3[0][0]                   
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 128, 128, 12) 48          conv2d_4[0][0]                   
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 128, 128, 24) 0           batch_normalization_4[0][0]      
                                                                 batch_normalization_5[0][0]      
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 64, 64, 24)   0           concatenate_1[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 64, 64, 24)   600         max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 64, 64, 24)   96          conv2d_5[0][0]                   
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 64, 64, 24)   600         batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 64, 64, 24)   5208        batch_normalization_6[0][0]      
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 64, 64, 24)   96          conv2d_6[0][0]                   
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 64, 64, 24)   96          conv2d_7[0][0]                   
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 64, 64, 48)   0           batch_normalization_7[0][0]      
                                                                 batch_normalization_8[0][0]      
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 32, 32, 48)   0           concatenate_2[0][0]              
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 32, 32, 32)   1568        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 32, 32, 32)   128         conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 32, 32, 32)   1056        batch_normalization_9[0][0]      
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, 32, 32, 32)   9248        batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 32, 32, 32)   128         conv2d_9[0][0]                   
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 32, 32, 32)   128         conv2d_10[0][0]                  
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 32, 32, 64)   0           batch_normalization_10[0][0]     
                                                                 batch_normalization_11[0][0]     
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, 16, 16, 64)   0           concatenate_3[0][0]              
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, 16, 16, 24)   1560        max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 16, 16, 24)   96          conv2d_11[0][0]                  
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, 16, 16, 24)   600         batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, 16, 16, 24)   5208        batch_normalization_12[0][0]     
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 16, 16, 24)   96          conv2d_12[0][0]                  
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 16, 16, 24)   96          conv2d_13[0][0]                  
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 16, 16, 48)   0           batch_normalization_13[0][0]     
                                                                 batch_normalization_14[0][0]     
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, 8, 8, 48)     0           concatenate_4[0][0]              
__________________________________________________________________________________________________
conv2d_14 (Conv2D)              (None, 8, 8, 18)     882         max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 8, 8, 18)     72          conv2d_14[0][0]                  
__________________________________________________________________________________________________
conv2d_15 (Conv2D)              (None, 8, 8, 18)     342         batch_normalization_15[0][0]     
__________________________________________________________________________________________________
conv2d_16 (Conv2D)              (None, 8, 8, 18)     2934        batch_normalization_15[0][0]     
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 8, 8, 18)     72          conv2d_15[0][0]                  
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 8, 8, 18)     72          conv2d_16[0][0]                  
__________________________________________________________________________________________________
concatenate_5 (Concatenate)     (None, 8, 8, 36)     0           batch_normalization_16[0][0]     
                                                                 batch_normalization_17[0][0]     
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, 4, 4, 36)     0           concatenate_5[0][0]              
__________________________________________________________________________________________________
conv2d_17 (Conv2D)              (None, 4, 4, 12)     444         max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 4, 4, 12)     48          conv2d_17[0][0]                  
__________________________________________________________________________________________________
conv2d_18 (Conv2D)              (None, 4, 4, 12)     156         batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv2d_19 (Conv2D)              (None, 4, 4, 12)     1308        batch_normalization_18[0][0]     
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 4, 4, 12)     48          conv2d_18[0][0]                  
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 4, 4, 12)     48          conv2d_19[0][0]                  
__________________________________________________________________________________________________
concatenate_6 (Concatenate)     (None, 4, 4, 24)     0           batch_normalization_19[0][0]     
                                                                 batch_normalization_20[0][0]     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 24)           0           concatenate_6[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 4)            100         global_average_pooling2d_1[0][0] 
==================================================================================================
Total params: 35,858
Trainable params: 35,102
Non-trainable params: 756
__________________________________________________________________________________________________
