Model: "model_4"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_4 (InputLayer)         (None, 120, 160, 3)       0         
_________________________________________________________________
block1_conv1 (Conv2D)        (None, 120, 160, 64)      1792      
_________________________________________________________________
block1_conv2 (Conv2D)        (None, 120, 160, 64)      36928     
_________________________________________________________________
block1_pool (MaxPooling2D)   (None, 60, 80, 64)        0         
_________________________________________________________________
block2_conv1 (Conv2D)        (None, 60, 80, 128)       73856     
_________________________________________________________________
block2_conv2 (Conv2D)        (None, 60, 80, 128)       147584    
_________________________________________________________________
block2_pool (MaxPooling2D)   (None, 30, 40, 128)       0         
_________________________________________________________________
block3_conv1 (Conv2D)        (None, 30, 40, 256)       295168    
_________________________________________________________________
block3_conv2 (Conv2D)        (None, 30, 40, 256)       590080    
_________________________________________________________________
block3_conv3 (Conv2D)        (None, 30, 40, 256)       590080    
_________________________________________________________________
block3_pool (MaxPooling2D)   (None, 15, 20, 256)       0         
_________________________________________________________________
block4_conv1 (Conv2D)        (None, 15, 20, 512)       1180160   
_________________________________________________________________
block4_conv2 (Conv2D)        (None, 15, 20, 512)       2359808   
_________________________________________________________________
block4_conv3 (Conv2D)        (None, 15, 20, 512)       2359808   
_________________________________________________________________
block4_pool (MaxPooling2D)   (None, 7, 10, 512)        0         
_________________________________________________________________
block5_conv1 (Conv2D)        (None, 7, 10, 512)        2359808   
_________________________________________________________________
block5_conv2 (Conv2D)        (None, 7, 10, 512)        2359808   
_________________________________________________________________
block5_conv3 (Conv2D)        (None, 7, 10, 512)        2359808   
_________________________________________________________________
block5_pool (MaxPooling2D)   (None, 3, 5, 512)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 7680)              0         
_________________________________________________________________
dropout_4 (Dropout)          (None, 7680)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 256)               1966336   
_________________________________________________________________
batch_normalization_4 (Batch (None, 256)               1024      
_________________________________________________________________
dense_8 (Dense)              (None, 4)                 1028      
=================================================================
Total params: 16,683,076
Trainable params: 16,643,844
Non-trainable params: 39,232
_________________________________________________________________
