Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, 60, 80, 3)         0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 58, 78, 64)        1792      
_________________________________________________________________
batch_normalization_1 (Batch (None, 58, 78, 64)        256       
_________________________________________________________________
dropout_1 (Dropout)          (None, 58, 78, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 76, 64)        36928     
_________________________________________________________________
batch_normalization_2 (Batch (None, 56, 76, 64)        256       
_________________________________________________________________
dropout_2 (Dropout)          (None, 56, 76, 64)        0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 28, 38, 64)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 26, 36, 128)       73856     
_________________________________________________________________
batch_normalization_3 (Batch (None, 26, 36, 128)       512       
_________________________________________________________________
dropout_3 (Dropout)          (None, 26, 36, 128)       0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 24, 34, 128)       147584    
_________________________________________________________________
batch_normalization_4 (Batch (None, 24, 34, 128)       512       
_________________________________________________________________
dropout_4 (Dropout)          (None, 24, 34, 128)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 17, 128)       0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 10, 15, 256)       295168    
_________________________________________________________________
batch_normalization_5 (Batch (None, 10, 15, 256)       1024      
_________________________________________________________________
dropout_5 (Dropout)          (None, 10, 15, 256)       0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 8, 13, 256)        590080    
_________________________________________________________________
batch_normalization_6 (Batch (None, 8, 13, 256)        1024      
_________________________________________________________________
dropout_6 (Dropout)          (None, 8, 13, 256)        0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 6, 11, 256)        590080    
_________________________________________________________________
batch_normalization_7 (Batch (None, 6, 11, 256)        1024      
_________________________________________________________________
dropout_7 (Dropout)          (None, 6, 11, 256)        0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 3, 6, 256)         0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 1, 4, 512)         1180160   
_________________________________________________________________
batch_normalization_8 (Batch (None, 1, 4, 512)         2048      
_________________________________________________________________
dropout_8 (Dropout)          (None, 1, 4, 512)         0         
_________________________________________________________________
dense_1 (Dense)              (None, 1, 4, 512)         262656    
_________________________________________________________________
dense_2 (Dense)              (None, 1, 4, 4)           2052      
=================================================================
Total params: 3,187,012
Trainable params: 3,183,684
Non-trainable params: 3,328
_________________________________________________________________
