Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 58, 78, 32)        896       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 76, 64)        18496     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 54, 74, 128)       73856     
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 52, 72, 128)       147584    
_________________________________________________________________
flatten_1 (Flatten)          (None, 479232)            0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               245367296 
_________________________________________________________________
dense_2 (Dense)              (None, 4)                 2052      
=================================================================
Total params: 245,610,180
Trainable params: 245,610,180
Non-trainable params: 0
_________________________________________________________________
